# RDBMS

## ipython - magic command sql

príkaz na vypísanie dostupných magických príkazov v aktuálnom prostredí

Line magics: Začínajú jedným znakom percenta (%) a pôsobia na jeden riadok kódu.
Cell magics: Začínajú dvoma znakmi percenta (%%) a pôsobia na celú bunku kódu.

In [2]:
lsmagic

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cd  %clear  %cls  %code_wrap  %colors  %conda  %config  %connect_info  %copy  %ddir  %debug  %dhist  %dirs  %doctest_mode  %echo  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %macro  %magic  %mamba  %matplotlib  %micromamba  %mkdir  %more  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %ren  %rep  %rerun  %reset  %reset_selective  %rmdir  %run  %save  %sc  %set_env  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%cmd  %%code_wrap  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

pip install ipython-sql

Najprv je potrebné doinštalovať do prostredia ipython-sql balík cez Anaconda PowerShell Prompt (run as administrator).

load_ext sql

A6 potom načítař rozšírenie SQL príkazom load_ext do prostredia Jupyter Notebook
T.j. pridá príkazy a funkcie umožňujúce vykonávať SQL dopyty

In [4]:
load_ext sql

In [6]:
lsmagic

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cd  %clear  %cls  %code_wrap  %colors  %conda  %config  %connect_info  %copy  %ddir  %debug  %dhist  %dirs  %doctest_mode  %echo  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %macro  %magic  %mamba  %matplotlib  %micromamba  %mkdir  %more  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %ren  %rep  %rerun  %reset  %reset_selective  %rmdir  %run  %save  %sc  %set_env  %sql  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%cmd  %%code_wrap  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%sql  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

### Pripojenie k MYSQL databáze

Pripojenie k MySQL databáze:
%sql - "magický príkaz" (magic command), preto začína znakom percenta (%). V tomto prípade %sql indikuje, že nasledujúci text je SQL dopyt alebo príkaz na prácu s databázou.
mysql:// - typ databázy, ku ktorej sa pripájame - MySQL databáza
pyth:pyth - meno/heslo
lektorsk9 - názov servera, na ktorom beží MySQL databáza
sakila - názov DB

Príkaz:
- nadviaže spojenie s MySQL databázou bežiacou na serveri lektorsk9
- autentifikuje sa pomocou používateľského mena pyth a hesla pyth
- nastaví DB sakila ako aktívnu pre ďalšie SQL dopyty

In [12]:
%sql mysql://pyth:pyth@lektorsk9/sakila

Na overenie verzie DB

In [18]:
sql select version()

 * mysql://pyth:***@lektorsk9/sakila
1 rows affected.

[('8.0.39',)]

In [20]:
sql show tables

 * mysql://pyth:***@lektorsk9/sakila
23 rows affected.

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

In [22]:
sql select count(*) as records_count from actor

 * mysql://pyth:***@lektorsk9/sakila
1 rows affected.

[(200,)]

### Načítanie tabuľky do premennej

In [34]:
sql select TOP 3 * from actor

 * mysql://pyth:***@lektorsk9/sakila
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '3 * from actor' at line 1")
[SQL: select TOP 3 * from actor]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [36]:
actor = %sql select * from actor # tu musí byť %, ak by to bolo bez priradenia do premennej actor, tak bez %, viď príkaz nad

 * mysql://pyth:***@lektorsk9/sakila
200 rows affected.

In [42]:
actor.__class__

sql.run.ResultSet

In [44]:
actor[0]

(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33))

In [46]:
actr_df  = actor.DataFrame()
actr_df.__class__

pandas.core.frame.DataFrame

In [48]:
actr_df.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [28]:
actor.__sizeof__()

1640

In [30]:
actr_df.__sizeof__()

25239

### Vytvorenie tabuľky

In [32]:
%%sql
create schema if not exists dana;
create table if not exists dana.gopas(id int primary key auto_increment,
                                     name varchar(10),
                                     salary int);

insert into dana.gopas(name, salary) values('fero', 1000);
insert into dana.gopas(name, salary) values('eva', 2000);
insert into dana.gopas(name, salary) values('jana', 3000);
insert into dana.gopas(name, salary) values('peter', 4000);

 * mysql://pyth:***@lektorsk9/sakila
1 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [34]:
sql select * from dana.gopas

 * mysql://pyth:***@lektorsk9/sakila
9 rows affected.

[(1, 'fero', 1000),
 (2, 'eva', 2000),
 (3, 'jana', 3000),
 (4, 'peter', 4000),
 (5, 'ivan', 5555),
 (6, 'fero', 1000),
 (7, 'eva', 2000),
 (8, 'jana', 3000),
 (9, 'peter', 4000)]

### Úloha: Načítaj tabuľku z MySQL databázy do premennej

meno: pyth
heslo: pyth
server: lektorsk9
DB: sakila

Načítaj tabuľku "actor" do premennej typu dataframe

In [77]:
# pip install ipython-sql
# load_ext sql
%sql mysql://pyth:pyth@lektorsk9/sakila
actor_result = %sql select * from actor
actor_df = actor_result.DataFrame()
actr_df.head()

 * mysql://pyth:***@lektorsk9/sakila
200 rows affected.

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

## JDBC/ODBC

pripojenie do databázy bez uloženia mena a hesla v notebooku

modul getpass umožňuje pracovať s MySQL databázou v Pythone a bezpečne zadávať heslo
modul MySQL - na pripojenie k MySQL DB, vykonávanie SQL dopytov

In [79]:
from getpass import getpass
from MySQLdb import connect

funkcia getpass() - výzva na zadanie hesla, ale znaky sa nezobrazujú na obrazovke

In [81]:
user = input('Zadaj login: ')
passwd = getpass.getpass('Zadaj heslo:')

Zadaj login:  pyth
Zadaj heslo: ········

In [84]:
# server: lektorsk9
# user: zadaný vyššie
# heslo: zadané vyššie
# databáza: dana
connection_string={'host':'lektorsk9', 'user':user, 'password':passwd, 'database':'dana'}

### uloženie mena a hesla do súboru

In [87]:
import json

In [91]:
with open('danadb.conf', 'w') as f:
    json.dump(connection_string,f)

### Načítanie tabuľky do premennej

In [95]:
with open('danadb.conf') as f:
    db=json.load(f)

In [97]:
conn = connect(**db) # dve * sú preto, že db je dictionary, ktorý sa má rozbaliť na vstupe

cursor = conn.cursor() # objekt conn reprezentuje spojenie s DB, metóda vytvorí kurzor = objekt, ktorý umožňuje komunikovať s DB
cursor.execute('select * from gopas') #mal by byt v try bloku
result = cursor.fetchall() # načíta všetky riadky výsledku dopytu a vráti ich ako zoznam n-tíc (tuples). Každá n-tica reprezentuje jeden riadok z tabuľky a obsahuje hodnoty jednotlivých stĺpcov

conn.close()
result

((1, 'fero', 1000),
 (2, 'eva', 2000),
 (3, 'jana', 3000),
 (4, 'peter', 4000),
 (5, 'ivan', 5555),
 (6, 'fero', 1000),
 (7, 'eva', 2000),
 (8, 'jana', 3000),
 (9, 'peter', 4000),
 (10, 'ivan', 5555))

In [99]:
result.__class__

tuple

In [101]:
result[0]

(1, 'fero', 1000)

In [103]:
result[0].__class__

tuple

## ORM ft Pandas/SQLAlchemy - uprav..

In [53]:
from sqlalchemy import create_engine
import pandas as pd
import json

In [55]:
with open('danadb.conf') as f:
    db=json.load(f)

In [57]:
f"mysql://{db['user']}:{db['password']}@{db['host']}/{db['database']}"

'mysql://pyth:pyth@lektorsk9/dana'

In [59]:
eng = create_engine(f"mysql://{db['user']}:{db['password']}@{db['host']}/{db['database']}")

In [61]:
pd.read_sql_table(con=eng, table_name='gopas') # totozny ako Sql select

   id   name  salary
0   1   fero    1000
1   2    eva    2000
2   3   jana    3000
3   4  peter    4000
4   5   ivan    5555
5   6   fero    1000
6   7    eva    2000
7   8   jana    3000
8   9  peter    4000

In [63]:
pd.read_sql_query(con=eng, sql='select name, salary from gopas limit 5')

    name  salary
0   fero    1000
1    eva    2000
2   jana    3000
3  peter    4000
4   ivan    5555

In [65]:
df = pd.DataFrame({'name': 'ivan', 'salary':5555}, index=[0])
df

   name  salary
0  ivan    5555

In [67]:
df.to_sql(con=eng, name='gopas', if_exists='append', index=False)

1

In [69]:
pd.read_sql_table(con=eng, table_name='gopas')

   id   name  salary
0   1   fero    1000
1   2    eva    2000
2   3   jana    3000
3   4  peter    4000
4   5   ivan    5555
5   6   fero    1000
6   7    eva    2000
7   8   jana    3000
8   9  peter    4000
9  10   ivan    5555